/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
* 文件名-FileName:			 BQ27410_FuelGauge.h
* 附属文件-Dependencies:  	 None	
* 文件描述-File Description:	 ( 头文件-Header File )
	■"BQ27410_FuelGauge 锂电池电量监测计"-驱动程序(外部资源)-头文件
	01)     02)     03)    04)    05)    06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01)     ▲02)     ▲03)    ▲04)    ▲05)    ▲06)     
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  
* 修改记录-Change History:   
	作者   时间        版本  内容描述
	Author 	 Date		   Rev      Comment
	-------------------------------------------------------------------------------
	BlueS	2013-09-25	  1.0	   
			xxxx-xx-xx	  x.x	   
			xxxx-xx-xx	  x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CS-EMLAB  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CS-EMLAB  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/

#ifndef  __BQ27410_FuelGauge_H 
#define  __BQ27410_FuelGauge_H 


////////////////////////////////////////////////////////////////////////////
//==**"此模块专用"宏定义**Module-specific macro**==============//
////////////////////////////////////////////////////////////////////////////
#define	ADDR_SLAVE_BQ27410 (0x55)	//BQ27410 的IIC从机物理地址


#define	ADDR_Charge_BQ27410	(0x0C)	


#define	CHARGE_0_BQ27410	   (1)	//电量=  0  //没电//电量级别
#define	CHARGE_0_9_BQ27410     (2)	//0<电量<= 9%  //报警//电量级别
#define	CHARGE_10_33_BQ27410   (3)  //10%<=电量<= 33%  //电量级别
#define	CHARGE_34_66_BQ27410   (4)	//34%<=电量<= 66%  //电量级别
#define	CHARGE_67_99_BQ27410   (5)	//67%<=电量<= 99%  //电量级别
#define	CHARGE_100_BQ27410	   (6)	//电量= 100%  //充满电//电量级别



////////////////////////////////////////////////////////////////////////////
//==**项目"专用"宏定义**Project-specific macro**================//
////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////
//==**全局变量定义**Global variables**========================//
////////////////////////////////////////////////////////////////////////////
extern u16 BQ27410_Charge;  //BQ27410 采样的锂电池电量值

extern u8 BQ27410_ChargeKind;  //BQ27410 采样的锂电池电量值的级别







////////////////////////////////////////////////////////////////////////////
//==**"函数"宏定义**Functions macro**=========================//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**"此模块专用"函数声明**Exported Module-specific funcitions**====//
////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////
//==**"外部" API 函数声明**Exported  API funcitions**===============//
////////////////////////////////////////////////////////////////////////////
extern void Initial_BQ27410_FuelGauge(void);  //初始化BQ27410电量计:  IIC_B配置,引脚切换到IIC引脚

extern void Sample_BQ27410_FuelGauge(void);  //BQ27410 采样锂电池的电量

extern void Deal_BQ27410_FuelGauge(void);  //处理BQ27410电量计

extern void Display_BQ27410_LCD_Segment(void);  //在段式LCD上显示BQ27410 采样得到的电量值

extern void Disp_BQ27410_FuelGauge(void); //在LCD_TFT上，显示"锂电池":状态+电量

extern void Display_BQ27410_LED_Segment(void);  //数码管LCD上显示BQ27410 采样得到的电量值



#endif   /* __BQ27410_FuelGauge_H  */


