/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
* 文件名-FileName:			 DC_Motor.c
* 附属文件-Dependencies:  	 DC_Motor.h; CD405x_Multiplexer.h; Timer.h; ADC.h; 
                                                    Hardware_Profile.h; Generic.h;
* 文件描述-File Description:	 ( 源程序-Source File) 
	■  "DC_Motor 直流电机"-驱动程序(外部资源)
	01)     02)     03)    04)    05)    06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01)     ▲02)     ▲03)    ▲04)    ▲05)    ▲06)     
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  
* 修改记录-Change History:   
	作者   时间        版本  内容描述
	Author 	 Date		   Rev      Comment
	-------------------------------------------------------------------------------
	BlueS	2012-12-12	  1.0	   
			xxxx-xx-xx	  x.x	   
			xxxx-xx-xx	  x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CS-EMLAB  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CS-EMLAB  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/


#include "Generic.h"	//常用程序编程规范、函数集 -头文件-Generic Type Definitions

#include "Hardware_Profile.h"  //处理器"硬件配置文件" -Hardware specific definitions for Processor


#include "ADC.h"   //"ADC"模数转换模块 -驱动程序-头文件(处理器内部资源) 
#include "Timer.h"     //"定时器" -驱动程序 -头文件(处理器内部资源)


#include "CD405x_Multiplexer.h"   //"CD405x_Multiplexer多路选择模拟开关"  -驱动程序(外部资源)-头文件


#include "DC_Motor.h"   //"DC_Motor 直流电机"-驱动程序(外部资源)-头文件



////////////////////////////////////////////////////////////////////////////
//==**全局变量定义**Global variables**========================//
////////////////////////////////////////////////////////////////////////////
union FLAGBIT DC_Motor_FlagBits; //"DC_Motor 直流电机"相关标志位变量


unsigned int G_DC_SpeedCnt = 0; //DC_Motor 直流电机"1秒内CCR3采样到的频率累加器
unsigned int G_DC_Speed = 0;   //DC_Motor 直流电机"1秒内CCR3采样到的频率次数

unsigned char G_DC_WorkState = 0; //运行状态-DC_Motor 直流电机"



////////////////////////////////////////////////////////////////////////////
//==**局部变量定义**Local variables**========================//
////////////////////////////////////////////////////////////////////////////


/****************************************************************************
*函数名-Function:	void Disable_DC_Motor(void)
*描述- Description:		禁止-"DC_Motor 直流电机"
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：
	▲01) "停止"" 直流电机"
	▲02) "禁止""DC_Motor 直流电机"
	▲03)"DRV8833 双路_H_桥接电机驱动器"
1) 能够驱动两个直流(DC)电机或一个双极性步进电机
2) 低MOSFET 导通电阻,宽电源电压范围：2.7V 至10.8V
3) 每个H 桥的输出电流为1.5-ARMS、2APP（在VM=5V 和25℃条件下）
	▲04)	
*****************************************************************************/
void Disable_DC_Motor(void)  //禁止-"DC_Motor 直流电机"
{
	G_DC_WorkState = STATE_Idle_DC_Motor;

////////////////////////////////////////////////////////////////////////////
//==**"停止"" 直流电机"(对应DRV8833的AIN1、BIN1引脚)**=====//
	Stop_DC_Motor();  //停转-"DC_Motor 直流电机"
	Stop_PWM_DC_Motor();  //停止PWM输出-"DC_Motor 直流电机"

////////////////////////////////////////////////////////////////////////////
//==**"关闭中断计数(用于计转速)**========================//
	TA1CTL &= ~TAIE;	//关定时器中断
	TA1CCTL2 &= ~CCIE;	  // 关CCR2中断


////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
	mLow_DC_Motor_AIN1_BIN1;//配置引脚为"输出",并输出"低"电平
	mLow_DC_Motor_AIN2_BIN2;//配置引脚为"输出",并输出"低"电平

////////////////////////////////////////////////////////////////////////////
//==**"禁止""DC_Motor 直流电机"(对应DRV8833的nSleep引脚)**====//
	mClose_DC_Motor_nSleep; //配置引脚为"输出",并"禁止"器件(低：进入低功耗)
}



/****************************************************************************
*函数名-Function:	void Enable_DC_Motor(void)
*描述- Description:		使能-"DC_Motor 直流电机"
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：
	▲01) 使能-"DC_Motor 直流电机"时。"禁止"-"Step_Motor 步进电机"
	▲02)    	▲03)    ▲04)  
*****************************************************************************/
void Enable_DC_Motor(void)  //使能-"DC_Motor 直流电机"
{
////////////////////////////////////////////////////////////////////////////
//==**"使能""DC_Motor 直流电机"(对应DRV8833的nSleep引脚)**====//
	mOpen_DC_Motor_nSleep;//配置引脚为"输出",并"使能"器件("高"电平有效)

////////////////////////////////////////////////////////////////////////////
//==**"禁止""Step_Motor 步进电机"(对应DRV8833的nSleep引脚)**===//
	mClose_Step_Motor_nSleep; //配置引脚为"输出",并"禁止"器件(低：进入低功耗)
}



/****************************************************************************
*函数名-Function:	void DC_Motor_Initial(void)
*描述- Description:		初始化设置:  "DC_Motor 直流电机"
		1) CD405x切到 "DC_Motor 直流电机"
		2) 配置IO: 定时器A0初始化设置(使用CCR1, CCR3)
		3) 配置:  
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01)    	▲02)    	▲03)    ▲04)  
*****************************************************************************/
void DC_Motor_Initial(void)  //初始化设置:  "DC_Motor 直流电机"
{
////////////////////////////////////////////////////////////////////////////
//==**CD405x切到 "DC_Motor 直流电机"**======================//
	CD405x_SelectChannel(CD405x_DC_Motor);  //CD405x切到"DC_Motor 直流电机"

////////////////////////////////////////////////////////////////////////////
//==**配置"DRV8833 双路_H_桥接电机驱动器" **=============//
	Disable_DC_Motor(); //禁止-"DC_Motor 直流电机"

////////////////////////////////////////////////////////////////////////////
//==**配置: 直流电机的PWM信号 **=======================//
	PWM_Timer2_Initial();  //PWM初使化: Timer2的相关配置(CCR0,CCR1,CCR2)-"DC_Motor 直流电机"

////////////////////////////////////////////////////////////////////////////
//==**使能: "DC_Motor 直流电机"**==========================//
	Enable_DC_Motor();  //使能-"DC_Motor 直流电机"


	G_DC_SpeedCnt = 0;
	G_DC_Speed = 0;

}


/****************************************************************************
*函数名-Function:	void Sample_DC_Motor_Frequency(void)
*描述- Description:		采样"DC_Motor 直流电机"转速(1s内的脉冲次数)
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：
	▲01) 在中断TIMER0_A1_ISR()调用
	▲02)    ▲03)    ▲04)  
*****************************************************************************/
void Sample_DC_Motor_Frequency(void)
{
	G_DC_SpeedCnt ++;  //累加频率计数器("DC_Motor 直流电机)
	
	if(F_1s_Frequency_DC_Motor)
	{
		F_1s_Frequency_DC_Motor = 0;

		G_DC_Speed = G_DC_SpeedCnt;  //采样1s内的频率脉冲次数
		
		G_DC_SpeedCnt = 0; //清频率计数器，重新采样
	}
}




/****************************************************************************
*函数名-Function:	void Stop_PWM_DC_Motor(void)
*描述- Description:		停止PWM输出-"DC_Motor 直流电机"
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01) 	▲02)    	▲03)    ▲04)  
*****************************************************************************/
void Stop_PWM_DC_Motor(void)  //停止PWM输出-"DC_Motor 直流电机"
{
	Stop_PWM_Timer2();//停止PWM输出(停止Timer2)-"DC_Motor 直流电机"
}


/****************************************************************************
*函数名-Function:	void Stop_DC_Motor(void)
*描述- Description:		停转-"DC_Motor 直流电机"
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01) 	▲02)    	▲03)    ▲04)  
*****************************************************************************/
void Stop_DC_Motor(void)  //停转-"DC_Motor 直流电机"
{
	mClose_DC_Motor_nSleep; //配置引脚为"输出",并"禁止"器件(低：进入低功耗)
	TA2CCR2 = 0;  //清零，输出"正转"占空比为0%	// CCR2 PWM duty cycle
	TA2CCR1 = 0;  //清零，输出"反转"占空比为0%	// CCR1 PWM duty cycle

}



/****************************************************************************
*函数名-Function:	void Positive_DC_Motor(void)
*描述- Description:		正转-"DC_Motor 直流电机"(根据电位计电压进行调速)
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01) 	▲02)    	▲03)    ▲04)  
*****************************************************************************/
void Positive_DC_Motor(void)  //正转-"DC_Motor 直流电机"(根据电位计电压进行调速)
{
	unsigned int Set_Speed;

////////////////////////////////////////////////////////////////////////////
//==**"使能""DC_Motor 直流电机"(对应DRV8833的nSleep引脚)**====//
	mOpen_DC_Motor_nSleep;//配置引脚为"输出",并"使能"器件("高"电平有效)


	Set_Speed = G_LastAdResult / (3300/1536);   // 3.3V对应最大占空比512
	
	TA2CCR2 = 0; // 清"正转"占空比(0%)

	TA2CCR1 = Set_Speed;		 //TA0CCR1调节占空比 
}


/****************************************************************************
*函数名-Function:	void Reverse_DC_Motor(void)
*描述- Description:		反转-"DC_Motor 直流电机"(根据电位计电压进行调速)
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01) 	▲02)    	▲03)    ▲04)  
*****************************************************************************/
void Reverse_DC_Motor(void)  //反转-"DC_Motor 直流电机"(根据电位计电压进行调速)
{
	unsigned int Set_Speed;

////////////////////////////////////////////////////////////////////////////
//==**"使能""DC_Motor 直流电机"(对应DRV8833的nSleep引脚)**====//
	mOpen_DC_Motor_nSleep;//配置引脚为"输出",并"使能"器件("高"电平有效)

	Set_Speed = G_LastAdResult / (3300/1536);   // 3.3V对应最大占空比512

	TA2CCR1 = 0; // 清"反转"占空比(0%)

	TA2CCR2 = Set_Speed;		 //TA0CCR1调节占空比 
}


