/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
* 文件名-FileName:			 Key.h
* 附属文件-Dependencies:  	 None	
* 文件描述-File Description:	 ( 头文件-Header File )
	■ 具体项目: "IO 按键" -驱动程序-头文件(外部资源)
	01)     02)     03)    04)    05)    06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01)     ▲02)     ▲03)    ▲04)    ▲05)    ▲06)     
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  
* 修改记录-Change History:   
	作者   时间        版本  内容描述
	Author 	 Date		   Rev      Comment
	-------------------------------------------------------------------------------
	BlueS	2012-12-12	  1.0	   
			xxxx-xx-xx	  x.x	   
			xxxx-xx-xx	  x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CS-EMLAB  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CS-EMLAB  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/


#ifndef  __Key_H 
#define  __Key_H 


////////////////////////////////////////////////////////////////////////////
//==**"此模块专用"宏定义**Module-specific macro**==============//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**键盘相关宏定义**================================//


#define M_KeyDelayTime  (4)      //用于调整按键灵敏度(即消抖时间)，以5ms为时基

	//用到P4.2 和P4.3，故为0x0C
#define M_KeyUsed       (0x0C)   //用于定义接8个按键，若定义为只使用第1,2个键时，则令 M_KeyUsed＝0x03 

#define M_NullKey       (0xFF)   //定义按键为无效键



////////////////////////////////////////////////////////////////////////////
//--**"矩阵按键值"宏定义**---------------------------------------//
////////////////////////////////////////////////////////////////////////////

#define Key_0      (0)    //定义"数字0键"
#define Key_1      (1)    //定义"数字1键"
#define Key_2      (2)    //定义"数字2键"
#define Key_3      (3)    //定义"数字3键"
#define Key_4      (4)    //定义"数字4键"
#define Key_5      (5)    //定义"数字5键"
#define Key_6      (6)    //定义"数字6键"
#define Key_7      (7)    //定义"数字7键"
#define Key_8      (8)    //定义"数字8键"
#define Key_9      (9)    //定义"数字9键"

//#define Key_Plus   (0xFF) //定义"+ 键"
//#define Key_Minus  (0xFF) //定义"-键"


/*****
////////////////////////////////////////////////////////////////////////////
//--**"设置时""矩阵按键值"宏定义**----------------------------//
////////////////////////////////////////////////////////////////////////////

#define Key_Up       (0xFF)   //定义"上翻键"   
#define Key_Down   (0xFF)   //定义"下翻键"
#define Key_Left      (0xFF)   //定义"左键"
#define Key_Right    (0xFF)   //定义"右键"


#define Key_Return   (0xFF)   //定义"返回键"
#define Key_Delete   (0xFF)   //定义"删除键"

#define Key_Menu    (0xFF)   //定义"菜单键"
#define Key_Ok        (0xFF)   //定义"确定键"


#define Key_Modify   (0xFF)   //定义"修改键"

#define Key_Option   (0xFF)   //定义"选择键"

////////////////////////////////////////////////////////////////////////////
//--**"控制工作时""矩阵按键值"宏定义**----------------------//
////////////////////////////////////////////////////////////////////////////

#define Key_Start     (0xFF)   //定义"运行键"值

#define Key_Stop     (0xFF)   //定义"停止键"值

#define Key_Test      (0xFF)   //定义"测试键"值

****/







////////////////////////////////////////////////////////////////////////////
//==**项目"专用"宏定义**Project-specific macro**================//
////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////
//==**全局变量定义**Global variables**========================//
////////////////////////////////////////////////////////////////////////////

extern union FLAGBIT16 KeyFlagBits; //按键用到的标志位定义
#define  G_KeyFlagBits	KeyFlagBits.FLAG16  
//#define	 F_ScanKey   KeyFlagBits.b.f0    
#define  F_KeyHave      KeyFlagBits.b.f1
#define  F_KeyRead	    KeyFlagBits.b.f2	
#define  F_KeyNull	    KeyFlagBits.b.f3	
#define  F_Ok_LongKey	KeyFlagBits.b.f4   //"确定键"长按标志位   
//#define   F_	KeyFlagBits.b.f5	
//#define  F_	KeyFlagBits.b.f6	
//#define  F_	KeyFlagBits.b.f7    
//#define   F_	KeyFlagBits.b.f8      
//#define   F_	KeyFlagBits.b.f9     
//#define   F_	KeyFlagBits.b.f10    
//#define   F_	KeyFlagBits.b.f11      
//#define   F_	KeyFlagBits.b.f12      
//#define   F_	KeyFlagBits.b.f13      
//#define   F_	KeyFlagBits.b.f14      
//#define   F_	KeyFlagBits.b.f15     



////////////////////////////////////////////////////////////////////////////
//==**局部变量定义**Local variables**========================//
////////////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////////////
//==**"函数"宏定义**Functions macro**=========================//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**"此模块专用"函数声明**Exported Module-specific funcitions**====//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**"外部" API 函数声明**Exported  API funcitions**===============//
////////////////////////////////////////////////////////////////////////////

extern void Scan_Key(void); // "IO口键盘"扫描，5ms扫描一次按键(中断里)

//extern void Decode_Key(void); //IO口键盘处理


extern unsigned char Detect_Key(void);  //检测有没有按键,并返回按键值(对于一般常用的按键)

extern unsigned char Detect_Press_Key(void); //存按键解码后的按键值(按下执行，松开停止)

extern unsigned char Detect_Long_Key(unsigned char SecondNum);//(长按X秒有效)检测有没有长按的按键,并返回按键值

extern unsigned char Detect_Key_1(void); //检测有没有按下IO按键"Key1"

extern unsigned char Detect_Key_2(void); //检测有没有按下IO按键"Key2"


#endif   /* __Key_H  */





