/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
◆项目-Project:			MSP430F6638-FFTB 一体化功能演示 
◆设计者-Author:		BlueS
◆处理器-Processor: 		MSP430f6638      
◆编译器-Complier: 		IAR for MSP430 v5.50.2  or higher
◆仿真器-IDE: 			IAR for MSP430 v5.50.2  or higher
◆版本-Version: 			V3.0
◆日期-Date: 			2013-08-23
①②③④⑤⑥⑦⑧⑨⑩
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 文件名-FileName:			 Main.c
* 附属文件-Dependencies:  	 System_HeadFile.h;
* 文件描述-File Description:	 ( 源程序-Source File)
	■01)  晶振:XT1: 外接32.768 KHz; 
	■02)  XT2 外接4MHz 作为SMCLK时钟源 
	■03)  系统频率MCLK =12M  (DCO  FLL倍频到12MHz)   
	■04)  SMCLK  =12M  (DCO  FLL倍频到12MHz)   
	■05)  ACLK = XT1 =   32.768 KHz
	■06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01)当 DCO  FLL倍频到12MHz 作为MCLK时钟源(系统频率)
	        故 __delay_cycles(12000000); //(1/12M)*12000000=1s
	▲02) 当 DCO  FLL倍频到20MHz(实际>20M) 作为MCLK时钟源(系统频率)
	        故 __delay_cycles(20000000); //约980ms ≈ (1/20M)*20000000=1s(系统频率>20M)   
	▲03)	  ▲04)    ▲05)      ▲06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  
* 修改记录-Change History:   
	作者   时间        版本  内容描述
	Author 	 Date		   Rev      Comment
	-------------------------------------------------------------------------------
	BlueS     2013-08-23	  3.0	   
	BlueS     2013-09-29	  3.1	   
			xxxx-xx-xx	  x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CS-EMLAB  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CS-EMLAB  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/


#include "System_HeadFile.h"   //引入: 系统全部头文件集(包含所有使用到的头文件)





/****************************************************************************
*函数名-Function:	int main(void)
*描述- Description:	主函数
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01)    ▲02)    ▲03)    ▲04)  
*****************************************************************************/
int main1(void)
{  
  	mClose_WDT;   // 关闭看门狗	 
	mDisable_GIE;  //禁止总中断

	System_Initial();  //  系统初使化 :单片机内部资源+外部基本资源的初使化

	System_Variable_Initial(); //系统变量初使化(包括状态机初使化)，分为"复位"和"上电"两种情况

	mEnable_GIE;  // 开启总中断//good 放在初始化最后面

	System_SelfCheck(); //系统上电自检:蜂鸣器,灯,液晶等模块自检


while(1)
{	
////////////////////////////////////////////////////////////////////////////
//==**系统每10ms"循环"执行一次程序**===================//
	System_GetLoopClockTick(); //每次"死等"延时10ms后，系统"循环"执行一次程序

////////////////////////////////////////////////////////////////////////////
//==**工作指示灯(每250s闪烁一次)**====================//
		//在自检和测试Led发光二极管时，工作指示灯不执行。
	if((G_MainState != MAIN_Self_Check)&&(G_WorkState != WORK_Led_Diode_Test))
	{
		System_Working_Led();  //单片机正常工作指示灯: 250ms闪烁一次//也说明晶振和系统频率都正确
	}


////////////////////////////////////////////////////////////////////////////
//==**处理显示: "彩屏LCD_TFT"**===============================//
	Deal_LCD_TFT();//LCD_TFT 显示控制//只更新内容变化的显示部分

////////////////////////////////////////////////////////////////////////////
//==**处理显示: "段式LCD_Segment"**===========================//
	Deal_LCD_Segment();//"段式LCD_Segment": 处理不同"工作模式"

////////////////////////////////////////////////////////////////////////////
//==**处理显示: "数码管LED_Segment"**=========================//
	Deal_LED_Segment();//"数码管LED_Segment": 处理不同"工作模式"


	if((G_WorkState != WORK_Speaker_Test)&&(G_WorkState != WORK_LCD_Segment_Test)&&(G_WorkState != WORK_BQ27410_Test))
	{
		////////////////////////////////////////////////////////////////////////////
		//==**系统每100ms 读取"实时时间"**======================//
		Deal_RTC(); //处理" RTC 实时时钟":采样实时时间，显示实时时间

		////////////////////////////////////////////////////////////////////////////
		//==**系统每100ms 采样一次"TMP006 温度"**====================//
		Deal_TMP006_Temperature();	//处理TMP006 温度,得到最后的"实际温度值"

		////////////////////////////////////////////////////////////////////////////
		//==**系统每100ms 采样一次"监测电流值"**================//
		Deal_INA21x();	//处理 "INA21x 电流分流监控器": AD采样，AD数据处理，显示处理		

		////////////////////////////////////////////////////////////////////////////
		//==**系统每1s 采样一次"BQ27410 得到的锂电池的电量"**====//
		Deal_BQ27410_FuelGauge();  //处理BQ27410 电量计
	}

	
////////////////////////////////////////////////////////////////////////////
//==**"处理"各系统Main█"状态"下的事务**================//
	Deal_MainState(); // "处理"各系统Main█"状态"下的事务 (状态机)

////////////////////////////////////////////////////////////////////////////
//==**"处理"各工作Work▓"状态"下的事务**===============//
	Deal_WorkState(); // "处理"各工作Work▓"状态"下的事务 (状态机)



////////////////////////////////////////////////////////////////////////////
//==**矩阵按键扫描"**=========================//
	if(G_WorkState == WORK_Speaker_Test)
	{
		Scan_MatrixKey(); //"矩阵键盘"扫描，5ms扫描一次按键(中断里) 	
	}




/*****************************************************


////////////////////////////////////////////////////////////////////////////
//==**系统处理"HR202_Humidity 电阻型湿度传感器"**=========//
		//在测试直流电机、步进电机时，因为引脚复用（CCR3），故在测试电机时，不采样湿度对应的频率
	if((G_MainState != MAIN_Step_Motor_Test)&&(G_MainState != MAIN_DC_Motor_Test)&&(G_WorkState != WORK_Speaker_Test)&&(G_WorkState != WORK_Microphone_Test))
	{                                                                                                                                                                                                                                                                                                        
		Deal_HR202_Humidity(); //处理 "HR202_Humidity 电阻型湿度传感器"
	}



*****************************************************/

}
}


