/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
* 文件名-FileName:			 MyProject.h
* 附属文件-Dependencies:  	 None	
* 文件描述-File Description:	 ( 头文件-Header File )
	■ 具体项目: 总功能程序-头文件
	01)     02)     03)    04)    05)    06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01)     ▲02)     ▲03)    ▲04)    ▲05)    ▲06)      
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  
* 修改记录-Change History:   
	作者   时间        版本  内容描述
	Author 	 Date		   Rev      Comment
	-------------------------------------------------------------------------------
	BlueS	2012-12-12	  1.0	   
			xxxx-xx-xx	  x.x	   
			xxxx-xx-xx	  x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CS-EMLAB  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CS-EMLAB  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/



#ifndef __MyProject_H
#define __MyProject_H


////////////////////////////////////////////////////////////////////////////
//==**项目"专用"宏定义**Project-specific macro**================//
////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////
//==**待机\常用状态值: 0x01--0xFF **=======================//
////////////////////////////////////////////////////////////////////////////
#define  MAIN_Self_Check         (0x00) //Main█系统自检状态
#define  MAIN_SetIdleState       (0x01) //Main█"设置"时的空闲状态
#define  MAIN_SetWaitProgrom     (0x02) //Main█"设置"时的待机状态
#define  MAIN_Restart            (0x03) //Main█ 重启，并系统自检--Restart Self-Test

//#define  MAIN_DisplayWaitingState (0x03) //Main█等待跳转时，显示等待状态界面

//#define  MAIN_CountMenu           (0x10) //Main█进入管理员帐户管理


//#define  MAIN_SetRight          (0x04) //Main█输入正确后，显示处理
//#define  MAIN_SetError          (0x05) //Main█进入错误显示处理

	//#define  MAIN_          (0xFE) //Main█备用  =Main
	//#define  MAIN_          (0xFF) //Main█备用  =Main


////////////////////////////////////////////////////////////////////////////
//==**主菜单状态值: 0x100--0x1FF **=========================//
////////////////////////////////////////////////////////////////////////////
#define  MAIN_MenuSelect          (0x100) //Main█菜单选择状态

#define  MAIN_CommonParameterMenu (0x101) //Main█进入基本常用参数设置菜单
#define  MAIN_WorkParameterMenu   (0x102) //Main█进入工作参数设置菜单

	///////#define  MAIN_xxx Menu         (0x103) //Main█进入XXX 设置
	///////#define  MAIN_xxx Menu         (0x104) //Main█进入XXX 设置
	///////#define  MAIN_xxx Menu         (0x105) //Main█进入XXX 设置
	///////#define  MAIN_xxx Menu         (0x106) //Main█进入XXX 设置

	///////#define  MAIN_xxx Menu   (0x107)  //Main█设置菜单
	///////#define  MAIN_xxx Menu   (0x108)  //Main█设置菜单

	///////#define  MAIN_xxx Menu   (0x1FF)  //Main█设置菜单


////////////////////////////////////////////////////////////////////////////
//==**01主菜单 :基本常用参数状态值: 0x200--0x3FF**========//
////////////////////////////////////////////////////////////////////////////

	////////////////////////////////////////////////////////////////////////////
	//--**基本参数: "时间修改"菜单0x200--0x21F **-------------------//
	////////////////////////////////////////////////////////////////////////////
#define  MAIN_ModifyTime      (0x200) //Main█"实时时间"修改状态


	////////////////////////////////////////////////////////////////////////////
	//--**基本参数: "液晶屏保"菜单0x220--0x23F**--------------------//
	////////////////////////////////////////////////////////////////////////////
#define  MAIN_ModifyBackLight         (0x220) //Main█进入屏保功能修改状态
#define  MAIN_ModifyBackLightFunction (0x221) //Main█修改屏保选择使能
#define  MAIN_ModifyBackLightTime     (0x222) //Main█修改屏保时间


	////////////////////////////////////////////////////////////////////////////
	//--**基本参数: "密码修改"菜单0x240--0x25F**--------------------//
	////////////////////////////////////////////////////////////////////////////
#define  MAIN_ModifyCountCode (0x240) //Main█进入管理员密码修改状态


		////////////////////////////////////////////////////////////////////////////
		//--**基本参数: "备用"菜单0x3E0--0x3FF**--------------------------//
		////////////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////////////
//==**02主菜单 :工作参数状态值: 0x400--0x5FF**=============//
////////////////////////////////////////////////////////////////////////////

	////////////////////////////////////////////////////////////////////////////
	//--**工作参数: "备用"菜单0x400--0x41F***--------------------------//
	////////////////////////////////////////////////////////////////////////////

	////////////////////////////////////////////////////////////////////////////
	//--**工作参数: "备用"菜单0x420--0x43F***--------------------------//
	////////////////////////////////////////////////////////////////////////////

		////////////////////////////////////////////////////////////////////////////
		//--**工作参数: "备用"菜单0x5E0--0x5FF***--------------------------//
		////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**03主菜单 :XXXX 状态值: 0x600--0x7FF**=============//
////////////////////////////////////////////////////////////////////////////

	////////////////////////////////////////////////////////////////////////////
	//--**XXXX : "备用"菜单0x600--0x61F***--------------------------//
	////////////////////////////////////////////////////////////////////////////

	////////////////////////////////////////////////////////////////////////////
	//--**XXXX : "备用"菜单0x620--0x63F***--------------------------//
	////////////////////////////////////////////////////////////////////////////

		////////////////////////////////////////////////////////////////////////////
		//--**XXXX : "备用"菜单0x7E0--0x7FF***--------------------------//
		////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**04主菜单 :XXXX 状态值: 0x800--0x9FF**=============//
////////////////////////////////////////////////////////////////////////////

	////////////////////////////////////////////////////////////////////////////
	//--**XXXX : "备用"菜单0x800--0x81F***--------------------------//
	////////////////////////////////////////////////////////////////////////////

	////////////////////////////////////////////////////////////////////////////
	//--**XXXX : "备用"菜单0x820--0x83F***--------------------------//
	////////////////////////////////////////////////////////////////////////////

		////////////////////////////////////////////////////////////////////////////
		//--**XXXX : "备用"菜单0x9E0--0x9FE***--------------------------//
		////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////
//==**工作"菜单"状态值: 0x7000--0x7FFF**====================//
////////////////////////////////////////////////////////////////////////////
#define  MAIN_Working_State       (0x7000) //Main█进入工作状态(工作时)

#define  MAIN_Basic_Settings      (0x7001) //Main█Basic_Settings 菜单选择(工作时)
#define  MAIN_Basic_Check         (0x7002) //Main█Basic_Check 菜单选择(工作时)
#define  MAIN_LCD_TFT_Test        (0x7003) //Main█LCD_TFT_Test 菜单选择(工作时)
#define  MAIN_MatrixKey_Test      (0x7004) //Main█MatrixKey_Test 菜单选择(工作时)
#define  MAIN_TouchPads_Test      (0x7005) //Main█TouchPads_Test 菜单选择(工作时)
#define  MAIN_INA21x_Current_Test (0x7006) //Main█INA21x_Current_Test 菜单选择(工作时)

#define  MAIN_Potentiometer_Test  (0x7007) //Main█Potentiometer_Test 菜单选择(工作时)
#define  MAIN_NTC_HR202_Test      (0x7008) //Main█NTC_HR202_Test(温湿度) 菜单选择(工作时)
#define  MAIN_Step_Motor_Test     (0x7009) //Main█Step_Motor_Test 菜单选择(工作时) 
#define  MAIN_DC_Motor_Test       (0x700A) //Main█DC_Motor_Test 菜单选择(工作时) 

#define  MAIN_TMP006_Temperature  (0x700B) //Main█TMP006_Temperature 菜单选择(工作时)
#define  MAIN_TMP100_Temperature  (0x700C) //Main█TMP100_Temperature 菜单选择(工作时)

#define  MAIN_IrDA_UART           (0x700D) //Main█IrDA_UART 菜单选择(工作时)
#define  MAIN_RS232_UART          (0x700E) //Main█RS232_UART 菜单选择(工作时)
#define  MAIN_RS485_UART          (0x700F) //Main█RS485_UART 菜单选择(工作时)
#define  MAIN_CC1101_Test         (0x7010) //Main█CC1101_Test 菜单选择(工作时)
#define  MAIN_SD_Card_Test        (0x7011) //Main█SD_Card_Test 菜单选择(工作时)
#define  MAIN_MassStorage_Test    (0x7012) //Main█MassStorage_Test 菜单选择(工作时)
#define  MAIN_MassStorage_USB     (0x7013) //Main█MassStorage_USB 菜单选择(工作时)


////////////////////////////////////////////////////////////////////////////
//==**工作运行常用状态: 0x8000--0x81FF**===================//
////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////
//==**"测试时"的空闲状态** ============================//

#define  WORK_Test_IdleState (0x8000) //Work▓"测试时"的空闲状态(工作时)


////////////////////////////////////////////////////////////////////////////
//==**"相关测试" ( 工作菜单)** ==========================//
#define  WORK_01_Test_1      (0x8001) //Work▓测试1  ( 01 种工作菜单)(工作时)
#define  WORK_01_Test_2      (0x8002) //Work▓测试2  ( 01 种工作菜单)(工作时)
#define  WORK_01_Test_3      (0x8003) //Work▓测试3  ( 01 种工作菜单)(工作时)
#define  WORK_01_Test_4      (0x8004) //Work▓测试4  ( 01 种工作菜单)(工作时)
#define  WORK_01_Test_5      (0x8005) //Work▓测试5  ( 01 种工作菜单)(工作时)
//#define  WORK_01_Test_6      (0x8006) //Work▓测试6  ( 01 种工作菜单)(工作时)
//"备用" 0x8007--0x800F


////////////////////////////////////////////////////////////////////////////
//==**"相关测试" ( 工作菜单)** ===========================//
#define  WORK_Self_Check       (0x8011) //Work▓Self_Check 测试(工作时)
#define  WORK_Led_Diode_Test   (0x8012) //Work▓Led_Diode_Test 测试(工作时)
#define  WORK_LED_Segment_Test (0x8013) //Work▓LED_Segment_Test 测试(工作时)
#define  WORK_LCD_Segment_Test (0x8014) //Work▓LCD_Segment_Test 测试(工作时)
#define  WORK_Buzzer_Test      (0x8015) //Work▓Buzzer_Test 测试(工作时)
#define  WORK_Speaker_Test     (0x8016) //Work▓Speaker_Test 测试(工作时)
#define  WORK_Microphone_Test  (0x8017) //Work▓Microphone_Test 测试(工作时)
#define  WORK_BQ27410_Test     (0x8018) //Work▓BQ27410_FuelGauge_Test 测试(工作时)


//"备用" 0x8016--0x801F

////////////////////////////////////////////////////////////////////////////
//==**"相关测试" ( 工作菜单)** ===========================//
#define  WORK_Line_LCD_TFT      (0x8021) //Work▓Line_LCD_TFT 测试(工作时)
#define  WORK_Rectangle_LCD_TFT (0x8022) //Work▓Rectangle_LCD_TFT 测试(工作时)
#define  WORK_Circle_LCD_TFT    (0x8023) //Work▓Circle_LCD_TFT 测试(工作时)
#define  WORK_FillArea_LCD_TFT  (0x8024) //Work▓FillArea_LCD_TFT 测试(工作时)
#define  WORK_Chinese_LCD_TFT   (0x8025) //Work▓Chinese_LCD_TFT 测试(工作时)
#define  WORK_Clear_LCD_TFT     (0x8026) //Work▓Clear_LCD_TFT 测试(工作时)

//"备用" 0x8027--0x801F




////////////////////////////////////////////////////////////////////////////
//==**"相关测试" ( 工作菜单)** ===========================//
#define  WORK_Idle_Step_Motor     (0x8030) //Work▓Idle_Step_Motor 测试(工作时)
#define  WORK_Positive_Step_Motor (0x8031) //Work▓Positive_Step_Motor 测试(工作时)
#define  WORK_Reverse_Step_Motor  (0x8032) //Work▓Reverse_Step_Motor 测试(工作时)
#define  WORK_Stop_Step_Motor     (0x8033) //Work▓Stop_Step_Motor 测试(工作时)
//"备用" 0x8034--0x803F


////////////////////////////////////////////////////////////////////////////
//==**"相关测试" ( 工作菜单)** ===========================//
#define  WORK_Idle_DC_Motor     (0x8040) //Work▓Idle_DC_Motor 测试(工作时)
#define  WORK_Positive_DC_Motor (0x8041) //Work▓Positive_DC_Motor 测试(工作时)
#define  WORK_Reverse_DC_Motor  (0x8042) //Work▓Reverse_DC_Motor 测试(工作时)
#define  WORK_Stop_DC_Motor     (0x8043) //Work▓Stop_DC_Motor 测试(工作时)
//"备用" 0x8044--0x804F




////////////////////////////////////////////////////////////////////////////
//==**"相关测试" ( 工作菜单)** ===========================//



////////////////////////////////////////////////////////////////////////////
//==**次系统状态值:  0x9000--0x9FFF **=======================//
////////////////////////////////////////////////////////////////////////////
#define  SUB_IdleState        (0x9000) //Sub◆空闲状态



////////////////////////////////////////////////////////////////////////////
//==**上位机与下位机的"命令"状态值:  0xA000--0xAFFF **=====//
////////////////////////////////////////////////////////////////////////////
#define  CMD_Into_WorkState   (0xA000) //Cmd★下位机进入"工作状态"



////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
//==**EEPROM 地址分配**EEPROM 地址分配**==================//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**常用EEPROM地址:  0x00 -- 0xFF *  256个*===================//
////////////////////////////////////////////////////////////////////////////

	//--**0x00    --    0x0F **  16个**未使用,备用**------------------------//

	//--**0x10    --    0x1F **  16个**程序密码保护(自定义)  ** --------//
//#define  ADDR_ProtectCode_Eeprom	(0x10)	 //存:程序密码保护EEPROM地址

	//---**0x20                 **    1个**液晶屏保使能 **-------------------//
#define  ADDR_BackLight_Eeprom     (0x20)  //存:液晶背光屏保常开\关,为1时为开；  为0时为关

	//--**0x21    --    0x24 **    4个**液晶屏保时间	**-------------------//
#define  ADDR_BackLightTime_Eeprom (0x21)  //存:液晶背光屏保时间参数,以秒为单位,,4位数

	//--**0x30 		           **    1个**按键声音使能**--------------------//


	//---**0x40    --     0x45 **	  6个**高级管理员密码**---------------//
#define  ADDR_SeniorCode_Eeprom    (0x40)  //存:高级管理员,6个密码  初始密码：000000


////////////////////////////////////////////////////////////////////////////
//==**参数设置EEPROM地址:  0x100  --  0xXXX*  XXX个*============//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**工作保存EEPROM地址:  0xXXX  --  0xXXX*  XXX个*============//
////////////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
//==**Flash 地址分配**Flash 地址分配**======================//
////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////
//==**常用Flash 地址:  0x00 -- 0xFF *  256个*=====================//
////////////////////////////////////////////////////////////////////////////

	//--**0x00    --    0x0F **  16个**未使用,备用**------------------------//

	//--**0x10    --    0x1F **  16个**程序密码保护(自定义)  ** --------//
//#define ADDR_ProtectCode_Flash	(0x10)	 //存:程序密码保护Flash地址

	//---**0x20                 **    1个**液晶屏保使能 **-------------------//
#define  ADDR_BackLight_Flash     (0x20)  //存:液晶背光屏保常开\关,为1时为开；  为0时为关

	//--**0x21    --    0x24 **    4个**液晶屏保时间	**-------------------//
#define  ADDR_BackLightTime_Flash (0x21)  //存:液晶背光屏保时间参数,以秒为单位,,4位数

	//--**0x30 		           **    1个**按键声音使能**--------------------//


	//---**0x40    --     0x45 **	  6个**高级管理员密码**---------------//
#define  ADDR_SeniorCode_Flash    (0x40)  //存:高级管理员,6个密码  初始密码：000000


////////////////////////////////////////////////////////////////////////////
//==**参数设置Flash 地址:  0x100  --  0xXXX*  XXX个*==============//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**工作保存Flash 地址:  0xXXX  --  0xXXX*  XXX个*==============//
////////////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////
//==**"具体项目" 全局变量定义**Global variables**============//
////////////////////////////////////////////////////////////////////////////


extern union FLAGBIT16 WorkFlagBits;  //"工作中"用到的时间标志位
#define  G_WorkFlagBits WorkFlagBits.FLAG16  
#define  F_EnUpdate_RS232    WorkFlagBits.b.f0  //为1时，刷新RS232_Test显示
#define  F_EnUpdate_RS485    WorkFlagBits.b.f1  //为1时，刷新RS485_Test显示
#define  F_EnUpdate_CC1101   WorkFlagBits.b.f2  //为1时，刷新CC1102_Test显示
//#define  F_	   WorkFlagBits.b.f3  //为1时，	 
//#define  F_        WorkFlagBits.b.f4  //为1时，
//#define  F_        WorkFlagBits.b.f5  //为1时，   
//#define  F_	   WorkFlagBits.b.f6  //为1时，   
//#define  F_         WorkFlagBits.b.f7  //为1时， 
//#define  F_	   WorkFlagBits.b.f8  //为1时，  
//#define  F_	   WorkFlagBits.b.f9  //为1时，	 
//#define  F_	   WorkFlagBits.b.f10 //为1时，	 
//#define  F_	   WorkFlagBits.b.f11 //为1时，	 
//#define  F_	   WorkFlagBits.b.f12 //为1时，	 	 
//#define  F_	   WorkFlagBits.b.f13 //为1时，	 	 
//#define  F_	   WorkFlagBits.b.f14 //为1时，	  
//#define  F_	   WorkFlagBits.b.f15 //为1时，	 	 

extern unsigned char G_KeyCnt; // 用于按键选择菜单

extern unsigned char G_SOS_Cnt; // 用于Led 实现SOS 功能



////////////////////////////////////////////////////////////////////////////
//==**"具体项目" 局部变量定义**Local variables**=============//
////////////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////////////
//==**"函数"宏定义**Functions macro**=========================//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**"此模块专用"函数声明**Exported Module-specific funcitions**====//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**"外部" API 函数声明**Exported  API funcitions**===============//
////////////////////////////////////////////////////////////////////////////

extern void Detect_Key_WorkMenu(void); //按"Key1","Key2"上下选择"工作菜单"

extern void Select_WorkMenu(void);//选择"工作菜单"

extern void SOS_Function(void);  //Led_Diode(发光二极管) 实现SOS 求救功能

extern void Deal_Main_Loop(void);  //主循环中的，循环执行的操作(显示、采样)



#endif   /* __MyProject_H */
















