/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
* 文件名-FileName:			 NTC_Temperature.c
* 附属文件-Dependencies:  	 NTC_Temperature.h; ADC.h;  MyProject_Set_LCD_TFT.h ;
                                                   Hardware_Profile.h; Generic.h;
* 文件描述-File Description:	 ( 源程序-Source File) 
	■"NTC 电阻温度传感器" -驱动程序(外部资源)
	01)	NTC (热敏电阻) MF52-103,3435 10K   ±1％精度 B值：3435
	02)     03)    04)    05)    06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01)     ▲02)     ▲03)    ▲04)    ▲05)    ▲06)     
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  
* 修改记录-Change History:   
	作者   时间        版本  内容描述
	Author 	 Date		   Rev      Comment
	-------------------------------------------------------------------------------
	BlueS	2012-12-12	  1.0	   
			xxxx-xx-xx	  x.x	   
			xxxx-xx-xx	  x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CS-EMLAB  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CS-EMLAB  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/

#include "Generic.h"	//常用程序编程规范、函数集 -头文件-Generic Type Definitions

#include "Hardware_Profile.h"  //处理器"硬件配置文件" -Hardware specific definitions for Processor

	//具体项目: LCD_TFT液晶显示部份(包括所有的液晶内容) -头文件
#include "MyProject_Set_LCD_TFT.h"  


#include "ADC.h"   //"ADC"模数转换模块 -驱动程序-头文件(处理器内部资源) 

#include "NTC_Temperature.h"  //"NTC 电阻温度传感器" -驱动程序(外部资源)-头文件


////////////////////////////////////////////////////////////////////////////
//==**全局变量定义**Global variables**========================//
////////////////////////////////////////////////////////////////////////////
union FLAGBIT16 NTC_TMP_FlagBits;	//"NTC 电阻温度传感器" 相关标志位变量

	//care--定义为整形，可正可负，温度可能为负值
int G_NTC_Temperature = 0; //把M_NTC_TMP_AdSampleNum次AD采样值从小到大排序后，并转化为最后的实际物理量


////////////////////////////////////////////////////////////////////////////
//==**局部变量定义**Local variables**========================//
////////////////////////////////////////////////////////////////////////////
unsigned int pNTC_TMP_AdBuf[M_NTC_TMP_AdSampleNum];  //数组用于缓存M_NTC_TMP_AdSampleNum次AD的采样值   
unsigned char pNTC_TMP_AdCnt = 0;  //pNTC_TMP_AdBuf[]对应的指针  


const unsigned long  NTC_103_INTERGER[151]={
  1905562 ,1834132 ,1756740 ,1676467 ,1595647 ,1515975 ,1438624 ,1364361 ,1293641 ,1226678 ,
  1163519 ,1104098 ,1048272 ,995847 ,946608 ,900326 ,856778 ,815747 ,777031 ,740442 ,
  705811 ,672987 ,641834 ,612233 ,584080 ,557284 ,531766 ,507456 ,484294 ,462224 ,
  441201 ,421180 ,402121 ,383988 ,366746 ,350362 ,334802 ,320035 ,306028 ,292750 ,
  280170 ,268255 ,256972 ,246290 ,236176 ,226597 ,217522 ,208916 ,200749 ,192988 ,
  185600 ,184818 ,181489 ,176316 ,169917 ,162797 ,155350 ,147867 ,140551 ,133536 ,
  126900 ,120684 ,114900 ,109539 ,104582 ,100000 ,95762 ,91835 ,88186 ,84784 ,
  81600 ,78608 ,75785 ,73109 ,70564 ,68133 ,65806 ,63570 ,61418 ,59343 ,
  57340 ,55405 ,53534 ,51725 ,49976 ,48286 ,46652 ,45073 ,43548 ,42075 ,
  40650 ,39271 ,37936 ,36639 ,35377 ,34146 ,32939 ,31752 ,30579 ,29414 ,
  28250 ,27762 ,27179 ,26523 ,25817 ,25076 ,24319 ,23557 ,22803 ,22065 ,
  21350 ,20661 ,20004 ,19378 ,18785 ,18225 ,17696 ,17197 ,16727 ,16282 ,
  15860 ,15458 ,15075 ,14707 ,14352 ,14006 ,13669 ,13337 ,13009 ,12684 ,
  12360 ,12037 ,11714 ,11390 ,11067 ,10744 ,10422 ,10104 ,9789 ,9481 ,
  9180 ,8889 ,8610 ,8346 ,8099 ,7870 ,7665 ,7485 ,7334 ,7214 ,7130 
};

const int NTC_103_FRACTION[150] = {
  7143 ,7739 ,8027 ,8082 ,7967 ,7735 ,7426 ,7072 ,6696 ,6316 ,
  5942 ,5583 ,5243 ,4924 ,4628 ,4355 ,4103 ,3872 ,3659 ,3463 ,
  3282 ,3115 ,2960 ,2815 ,2680 ,2552 ,2431 ,2316 ,2207 ,2102 ,
  2002 ,1906 ,1813 ,1724 ,1638 ,1556 ,1477 ,1401 ,1328 ,1258 ,
  1192 ,1128 ,1068 ,1011 ,958 ,908 ,861 ,817 ,776 ,739 ,
  78 ,333 ,517 ,640 ,712 ,745 ,748 ,732 ,702 ,664 ,
  622 ,578 ,536 ,496 ,458 ,424 ,393 ,365 ,340 ,318 ,
  299 ,282 ,268 ,255 ,243 ,233 ,224 ,215 ,208 ,200 ,
  194 ,187 ,181 ,175 ,169 ,163 ,158 ,153 ,147 ,142 ,
  138 ,134 ,130 ,126 ,123 ,121 ,119 ,117 ,117 ,116 ,
  49 ,58 ,66 ,71 ,74 ,76 ,76 ,75 ,74 ,72 ,
  69 ,66 ,63 ,59 ,56 ,53 ,50 ,47 ,44 ,42 ,
  40 ,38 ,37 ,35 ,35 ,34 ,33 ,33 ,33 ,32 ,
  32 ,32 ,32 ,32 ,32 ,32 ,32 ,32 ,31 ,30 ,
  29 ,28 ,26 ,25 ,23 ,21 ,18 ,15 ,12 ,8 
};



/****************************************************************************
*函数名-Function:	int ConverseToTemperature(long R)
*描述- Description:	转换"NTC 电阻温度传感器" AD值为实际"温度值"
*输入参数-Input:	R 
*输出参数-output:	res
*注意事项-Note： ▲01)	▲02) 	▲03) 	▲04)  
*****************************************************************************/
int ConverseToTemperature(long R) //转换"NTC 电阻温度传感器" AD值为实际"温度值"
{
  char high,i;
  int low;
  int integer,fraction;
  int res=0;
  low = 60; high = 65;
  while(low < high)
  {
    if(NTC_103_INTERGER[low] < R)
    {
      high = low;
      low = low - 5;
    }
    else if(NTC_103_INTERGER[high] > R)
    {
      low = high;
      high = high + 5;
    }
    else
    {
      for(i = low; i <= high; i++)
      {
        if(NTC_103_INTERGER[i+1] < R)
        {
          fraction = (NTC_103_INTERGER[i] - R)/NTC_103_FRACTION[i];
          integer = (i - 40) * 10;  //i-40得到实际温度值的整数后，放大10倍后，再与后面的小数相加
          res = integer + fraction;
          break;
        }
      }
      break;
    }
  }
  return res;
}




/****************************************************************************
*函数名-Function:	void Sample_NTC_TMP_AD(void)
*描述- Description:		多次采样"NTC 电阻温度传感器" AD
	1) 多次采样值，2) 进行排序，3) 去掉两头，
	4) 对中间的几个AD值求平均，得到最后的AD值。
	5) 将最后的AD值，转换成实际物理量值
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01)	▲02) 	▲03) 	▲04)  
*****************************************************************************/
void Sample_NTC_TMP_AD(void) //多次采样"NTC 电阻温度传感器" AD
{
  	unsigned char i,k;
  	unsigned int mid;
	long R;


						//"NTC 电阻温度传感器" 使用AD12(第12 AD通道)
	pNTC_TMP_AdBuf[pNTC_TMP_AdCnt] = Sample_ADC12_A(M_NTC_TMP_AdNum); //数组用于缓存M_NTC_TMP_AdSampleNum次AD的采样值	 
	pNTC_TMP_AdCnt ++;	//pNTC_TMP_AdBuf[]对应的指针  
	
	if(pNTC_TMP_AdCnt >= M_NTC_TMP_AdSampleNum)
	{
		pNTC_TMP_AdCnt = 0;
		
		for(i = 0; i < M_NTC_TMP_AdSampleNum-1; i++)	   //对M_NTC_TMP_AdSampleNum次采样的AD值进行排序,取中间值
		{
			for(k = i+1; k < M_NTC_TMP_AdSampleNum; k++)	 //排完序后，数组里的数从小到大
			{
				if(pNTC_TMP_AdBuf[i] > pNTC_TMP_AdBuf[k])
				{
					mid = pNTC_TMP_AdBuf[i];
					pNTC_TMP_AdBuf[i] = pNTC_TMP_AdBuf[k];	 
					pNTC_TMP_AdBuf[k] = mid;
				} 
			}
	
		}
			//care若M_NTC_TMP_AdSampleNum为16次，排序后，取中间4个数求和取平均
		G_NTC_Temperature = pNTC_TMP_AdBuf[(M_NTC_TMP_AdSampleNum/2)-1]+pNTC_TMP_AdBuf[M_NTC_TMP_AdSampleNum/2]+pNTC_TMP_AdBuf[(M_NTC_TMP_AdSampleNum/2)+1]+pNTC_TMP_AdBuf[(M_NTC_TMP_AdSampleNum/2)+2]; 			

		G_NTC_Temperature = G_NTC_Temperature/4;

////////////////////////////////////////////////////////////////////////////
//==**得到最后的AD值后，转换成相应的物理量**=======//
		R = 100000 * (long)G_NTC_Temperature / (4096 - G_NTC_Temperature);
		G_NTC_Temperature = ConverseToTemperature(R);
	}
}




/****************************************************************************
*函数名-Function:	void Deal_NTC_Temperature(void)
*描述- Description:		处理 "NTC 电阻温度传感器" : AD采样，AD数据处理，显示处理
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note： ▲01)	▲02) 	▲03) 	▲04)  
*****************************************************************************/
void Deal_NTC_Temperature(void)  //处理 "NTC 电阻温度传感器" : AD采样，AD数据处理，显示处理
{
////////////////////////////////////////////////////////////////////////////
//==**系统每10ms 采样一次"NTC 温度"**====================//
	Sample_NTC_TMP_AD();  //多次采样"NTC 电阻温度传感器" AD
	
}




