/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
* 文件名-FileName:			 Timer.c
* 附属文件-Dependencies:  	 Timer.h; msp430f6638.h;	Hardware_Profile.h; Generic.h;
* 文件描述-File Description:	 ( 源程序-Source File)
	■ "定时器" -驱动程序(处理器内部资源)
	01)     02)     03)    04)    05)    06)	
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01)     ▲02)     ▲03)    ▲04)    ▲05)    ▲06)     
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  
* 修改记录-Change History:   
	作者   时间        版本  内容描述
	Author 	 Date		   Rev      Comment
	-------------------------------------------------------------------------------
	BlueS	2012-12-12	  1.0	   
			xxxx-xx-xx	  x.x	   
			xxxx-xx-xx	  x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CS-EMLAB  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CS-EMLAB  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/


#include "Generic.h"	//常用程序编程规范、函数集 -头文件-Generic Type Definitions

#include "Hardware_Profile.h"  //处理器"硬件配置文件" -Hardware specific definitions for Processor


#include "msp430f6638.h"   // "处理器"头文件: 内部寄存相关定义等(处理器内部资源) 

#include "Timer.h"     //"定时器" -驱动程序 -头文件(处理器内部资源)


////////////////////////////////////////////////////////////////////////////
//==**全局变量定义**Global variables**========================//
////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////
//==**局部变量定义**Local variables**========================//
////////////////////////////////////////////////////////////////////////////



/****************************************************************************
*函数名-Function:	void Init_Timer0_B(void)
*描述- Description:		定时器B 初始化设置(用于系统每1ms自动中断一次)
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：
	▲01) 作为系统基本时钟   
	▲02) TimerB 只有一个定时器TB0
	▲03)    ▲04)  
**********************************************************
void Init_Timer0_B(void)  //定时器B 初始化设置(用于系统每1ms自动中断一次)
{
		// 使能此定时器的中断, 增计数模式：定时器增计数到 TBCCR0,再从0重新计数
	TBCTL = TBSSEL_2 + MC_1 + TBCLR + TBIE;  // 选SMCLK作为此定时器的时钟源, 清零 TBR

		//care	为"SMCLK=XT2=4 MHz"的情况下:  定时时间为1ms = 4000/4M(示波器实测1ms)			   
	TBCCR0 = 4000; 

	//care	为"SMCLK=DCO=20 MHz"的情况下(实际DCO频率>20M):  定时时间为1ms = 20000/20M(示波器实测1ms,则TBCCR0要为20620)			   
	//TBCCR0 = 20620; 
}
*******************/


/****************************************************************************
*函数名-Function:	void Init_Timer0_A(void)
*描述- Description:		定时器A0初始化设置(用于系统每1ms自动中断一次)
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：
	▲01) 作为系统基本时钟   
	▲02)    ▲03)    ▲04)  
*****************************************************************************/
void Init_Timer0_A(void) //定时器A0初始化设置(用于系统每1ms自动中断一次)
{
		// 使能Timer0中断, 增计数模式：定时器增计数到 TAxCCR0,再从0重新计数
	TA0CTL = TASSEL_2 + MC_1 + TACLR + TAIE;  // 选SMCLK作为Timer2的时钟源, 清零 TAR

		//care	为"SMCLK=XT2=4 MHz"的情况下:  定时时间为1ms = 4000/4M(示波器实测1ms)			   
//	TA0CCR0 = 4000; 
	TA0CCR0 = 12000; 

		
	//care	为"SMCLK=DCO=20 MHz"的情况下(实际DCO频率>20M):  定时时间为1ms = 20000/20M(示波器实测1ms,则TA2CCR0要为20620)			   
	//TA2CCR0 = 20620; 
}




	
/****************************************************************************
*函数名-Function:	void Init_Timer2_A(void)
*描述- Description:		定时器A2初始化设置(用于系统每1ms自动中断一次)
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：
	▲01) 作为系统基本时钟   
	▲02)    ▲03)    ▲04)  
***********************************************
void Timer2_Initial(void)
{
		// 使能Timer2中断, 增计数模式：定时器增计数到 TAxCCR0,再从0重新计数
	TA2CTL = TASSEL_2 + MC_1 + TACLR + TAIE;  // 选SMCLK作为Timer2的时钟源, 清零 TAR

		//care	为"SMCLK=XT2=4 MHz"的情况下:  定时时间为1ms = 4000/4M(示波器实测1ms)			   
	TA2CCR0 = 4000; 

		
	//care	为"SMCLK=DCO=20 MHz"的情况下(实际DCO频率>20M):  定时时间为1ms = 20000/20M(示波器实测1ms,则TA2CCR0要为20620)			   
	//TA2CCR0 = 20620; 
}
******************************/


/****************************************************************************
*函数名-Function:	void  Timer1_Initial_HR202_Humidity(void)
*描述- Description:		定时器A1初始化设置(用于"HR202_Humidity 电阻型湿度传感器")
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：
▲01) 	▲02)    ▲03)    ▲04)  
*****************************************************************************/
void Timer1_Initial_HR202_Humidity(void) //定时器A1初始化设置(用于"HR202_Humidity 电阻型湿度传感器")
{
////////////////////////////////////////////////////////////////////////////
//==**配置:  " TA1CTL (Timer_A1控制寄存器)"**==================//
	//让Timer_A1处于停止模式
	TA1CTL &= ~(MC1 + MC0);
		//TA0CTL  Timer_A0控制寄存器
		//MCx	模式控制。//00	停止模式：定时器是停止的。//01 增计数模式：定时器增计数到TAxCCR0 //10 连续计数模式：定时器增计数到0FFFFh //11 增减计数模式：定时器增计数到TAxCCR0 然后减计到0000h

	//选择时钟源SMCLK +Timer_A 清零(复位TAxR)
	TA1CTL = TASSEL_2 + TACLR;
		//TASSELx Timer_A时钟源选择//00 TACLK //01 ACLK  //10 SMCLK  //11 INCLK
		//TACLR  Timer_A 清零.置位该位将复位TAxR，TACLK 分频和计数方向。该位会自动复位，且读出的值为0。


////////////////////////////////////////////////////////////////////////////
//==**配置IO:  CCR3的输入口**=============================//
	mSelect_HR202_CCR3; //配置引脚为"外围模块功能"引脚
	mSetIn_HR202_CCR3; //配置引脚为"输入"

////////////////////////////////////////////////////////////////////////////
//==**配置:  " CCR2 (TA1CCTL2 )"**==============================//
	//CCR2//选择01 上升沿捕获+	同步捕获+CCIxA+捕获模式+捕获/比较中断
	TA1CCTL2 = CM_1 + SCS + CCIS_0 + CAP + CCIE;
		//TA0CCTL3 捕获/比较控制寄存器
		//CMx  捕获模式。//00 禁止捕获模式//01 上升沿捕获//10 下降沿捕获//11 上升沿与下降沿都捕获
		//SCS  同步捕获源。该位用来同步定时器时钟和捕获信号。//0  异步捕获 //1 同步捕获
		//CCISx 捕获/比较输入选择。这些位选择TAxCCRn 输入信号。//00 CCIxA  //01 CCIxB  //10 GND  //11 Vcc
		//CAP  捕获模式  //0  比较模式	// 1  捕获模式
		//CCIE 捕获/比较中断使能。该位使能相应的CCIFG 标志的中断请求。

////////////////////////////////////////////////////////////////////////////
//==**启动定时器开始计数(选择计数模式)"**============//
		//care--MCx>0 并且时钟源在活动状态时，定时器开始计数
	TA1CTL |= MC_2; //选择连续计数模式，并开始计数(定时器增计数到0FFFFh)

}


/****************************************************************************
*函数名-Function:	void PWM_Timer2_Initial(void)
*描述- Description:		PWM初使化: Timer2的相关配置(CCR0,CCR1,CCR2)-"DC_Motor 直流电机"
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01) 	▲02)    	▲03)    ▲04)  
*****************************************************************************/
void PWM_Timer2_Initial(void) //PWM初使化: Timer2的相关配置(CCR0,CCR1,CCR2)-"DC_Motor 直流电机"
{	

////////////////////////////////////////////////////////////////////////////
//==**"Timer_A2_CCR0"**==TA2CCR0调节"PWM周期"=================//
	//CCR0
	//TA2CCR0 = 312-1;   //PWM周期=  512/4M = 128us   (SMCLK为4MHz)// PWM Period
TA2CCR0 = 1536-1;   //PWM周期=  512/12M = 128us	(SMCLK为12MHz)// PWM Period


////////////////////////////////////////////////////////////////////////////
//==**"Timer_A2_CCR2"**==TA0CCR2调节"正转"占空比=============//
	//CCR2
	mSelect_DC_Motor_AIN2_BIN2_FunctionPin; //配置引脚为"外围模块功能"引脚 
	mSetOut_DC_Motor_AIN2_BIN2; //配置引脚都为"输出"

	//CCR2//输出模式: 复位/置位  // CCR0 reset/set
	TA2CCTL2 = OUTMOD_7;                    
		//TA2CCTLx，捕获/比较控制寄存器
		//OUTMODx  输出模式。由于EQUx=EQU0，模式2，3，6 和7 不适用于TAxCCR0
		//      000 OUT位的值//001 置位; 010 翻转/复位; 011 置位/复位;100 翻转;101 复位 ;110 翻转/置位 ;111 复位/置位

	TA2CCR2 = 0;   //清零，输出"正转"占空比为0%  // CCR2 PWM duty cycle


//==**"Timer_A2_CCR1"**==TA0CCR1调节"反转"占空比=============//
	mSelect_DC_Motor_AIN1_BIN1_FunctionPin; //配置引脚为"外围模块功能"引脚 
	mSetOut_DC_Motor_AIN1_BIN1; //配置引脚都为"输出"

	//CCR1//输出模式: 复位/置位  // CCR0 reset/set
	TA2CCTL1 = OUTMOD_7;                      // CCR0 reset/set
	//TA0CCTLx，捕获/比较控制寄存器
	//OUTMODx  输出模式。由于EQUx=EQU0，模式2，3，6 和7 不适用于TAxCCR0
	//		000 OUT位的值//001 置位; 010 翻转/复位; 011 置位/复位;100 翻转;101 复位 ;110 翻转/置位 ;111 复位/置位

	TA2CCR1 = 0;   //清零，输出"反转"占空比为0%  // CCR1 PWM duty cycle


////////////////////////////////////////////////////////////////////////////
//==**"配置Timer_A2控制寄存器"**==========================//
	//时钟源选择SMCLK+增计数模式+Timer_A 清零(复位TAxR)
	TA2CTL = TASSEL_2 + MC_1 + TACLR;         // SMCLK, up mode, clear TAR 
		//TA2CTL  Timer_A0控制寄存器
		//TASSELx  Timer_A时钟源选择//00 TACLK  ;01 ACLK ;10 SMCLK; 11 INCLK
		//MCx  模式控制。当Timer_A不用于节电模式时，设置MCx=00h。
				//00 停止模式：定时器是停止的。; 01 增计数模式：定时器增计数到TAxCCR0 ; 10 连续计数模式：定时器增计数到0FFFFh; 11 增减计数模式：定时器增计数到TAxCCR0 然后减计到0000h
		//TACLR  Timer_A 清零.置位该位将复位TAxR，TACLK 分频和计数方向。该位会自动复位，且读出的值为0。


////////////////////////////////////////////////////////////////////////////
//==**"Timer_A1_CCR2"**==用来累加转速的脉冲计数==========//

////////////////////////////////////////////////////////////////////////////
//==**配置:  " TA1CTL (Timer_A1控制寄存器)"**==================//
	//让Timer_A1处于停止模式
	TA1CTL &= ~(MC1 + MC0);
		//TA0CTL  Timer_A0控制寄存器
		//MCx	模式控制。//00	停止模式：定时器是停止的。//01 增计数模式：定时器增计数到TAxCCR0 //10 连续计数模式：定时器增计数到0FFFFh //11 增减计数模式：定时器增计数到TAxCCR0 然后减计到0000h

	//选择时钟源SMCLK +Timer_A 清零(复位TAxR)
	TA1CTL = TASSEL_2 + TACLR;
		//TASSELx Timer_A时钟源选择//00 TACLK //01 ACLK  //10 SMCLK  //11 INCLK
		//TACLR  Timer_A 清零.置位该位将复位TAxR，TACLK 分频和计数方向。该位会自动复位，且读出的值为0。

////////////////////////////////////////////////////////////////////////////
//==**配置IO:  CCR2的输入口**=============================//
	mSetIn_DC_Motor_CCR3; //配置引脚为"输入"
	mSelect_DC_Motor_CCR3;//配置引脚为"外围模块功能"引脚
	

	//CCR2//选择01 上升沿捕获+	同步捕获+CCIxA+捕获模式+捕获/比较中断
	TA1CCTL2 = CM_1 + SCS + CCIS_0 + CAP + CCIE;
		//TA1CCTL2 捕获/比较控制寄存器
		//CMx  捕获模式。//00 禁止捕获模式//01 上升沿捕获//10 下降沿捕获//11 上升沿与下降沿都捕获
		//SCS  同步捕获源。该位用来同步定时器时钟和捕获信号。//0  异步捕获 //1 同步捕获
		//CCISx 捕获/比较输入选择。这些位选择TAxCCRn 输入信号。//00 CCIxA  //01 CCIxB  //10 GND  //11 Vcc
		//CAP  捕获模式  //0  比较模式	// 1  捕获模式
		//CCIE 捕获/比较中断使能。该位使能相应的CCIFG 标志的中断请求。

////////////////////////////////////////////////////////////////////////////
//==**启动定时器开始计数(选择计数模式)"**============//
		//care--MCx>0 并且时钟源在活动状态时，定时器开始计数
	TA1CTL |= MC_2; //选择连续计数模式，并开始计数(定时器增计数到0FFFFh)

}


/****************************************************************************
*函数名-Function:	void Stop_PWM_Timer2(void)
*描述- Description:		停止PWM输出(停止Timer2)-"DC_Motor 直流电机"
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：	▲01) 	▲02)    	▲03)    ▲04)  
*****************************************************************************/
void Stop_PWM_Timer2(void)  //停止PWM输出(停止Timer2)-"DC_Motor 直流电机"
{	
	//00 停止模式：定时器是停止的
	TA2CTL = MC_0;        
	
	TA2CCR2 = 0;  //清零，输出"正转"占空比为0%  // CCR2 PWM duty cycle
	TA2CCR1 = 0;  //清零，输出"反转"占空比为0%  // CCR1 PWM duty cycle
}


/****************************************************************************
*函数名-Function:	void  Timer2_Initial_Step_Motor(void)
*描述- Description:		定时器A2初始化设置("Step_Motor 步进电机")
*输入参数-Input:	None
*输出参数-output:	None
*注意事项-Note：
▲01) 	▲02)    ▲03)    ▲04)  
*****************************************************************************/
void Timer2_Initial_Step_Motor(void) //定时器A2初始化设置("Step_Motor 步进电机")
{
////////////////////////////////////////////////////////////////////////////
//==**"配置Timer_A2控制寄存器"**==========================//
		//时钟源选择ACLK+增计数模式+Timer_A 清零(复位TAxR)
	TA2CTL = TASSEL_1 + MC_1 + TACLR;		  // ACLK, upmode, clear TAR
		//TA2CTL  Timer_A2控制寄存器
		//TASSELx  Timer_A时钟源选择//00 TACLK	;01 ACLK ;10 SMCLK; 11 INCLK
		//MCx  模式控制。当Timer_A不用于节电模式时，设置MCx=00h。
				//00 停止模式：定时器是停止的。; 01 增计数模式：定时器增计数到TAxCCR0 ; 10 连续计数模式：定时器增计数到0FFFFh; 11 增减计数模式：定时器增计数到TAxCCR0 然后减计到0000h
		//TACLR  Timer_A 清零.置位该位将复位TAxR，TACLK 分频和计数方向。该位会自动复位，且读出的值为0。


////////////////////////////////////////////////////////////////////////////
//==**"Timer_A2_CCR0"**==TA2CCR0调节转速(电机换向时间)"=======//
	TA2CCTL1 = 0; TA2CCTL2 = 0; //TA2CCTL3 = 0; TA2CCTL4 = 0;
	TA2CCR0 = 50000;   //步进电机，最高速度为TA2CCR0 = 4000;  最低速度设为TA2CCR0 = 50000
	TA2CCTL0 = CCIE;  // CCR0 interrupt enabled



//////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////
//==**"Timer_A1_CCR2"**==用来累加转速的脉冲计数==========//
//////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////
//==**配置:  " TA1CTL (Timer_A1控制寄存器)"**==================//
	//让Timer_A1处于停止模式
	TA1CTL &= ~(MC1 + MC0);
		//TA0CTL  Timer_A0控制寄存器
		//MCx	模式控制。//00	停止模式：定时器是停止的。//01 增计数模式：定时器增计数到TAxCCR0 //10 连续计数模式：定时器增计数到0FFFFh //11 增减计数模式：定时器增计数到TAxCCR0 然后减计到0000h

	//选择时钟源SMCLK +Timer_A 清零(复位TAxR)
	TA1CTL = TASSEL_2 + TACLR;
		//TASSELx Timer_A时钟源选择//00 TACLK //01 ACLK  //10 SMCLK  //11 INCLK
		//TACLR  Timer_A 清零.置位该位将复位TAxR，TACLK 分频和计数方向。该位会自动复位，且读出的值为0。


////////////////////////////////////////////////////////////////////////////
//==**配置IO:  CCR2的输入口**=============================//
	mSetIn_Step_Motor_CCR3; //配置引脚为"输入"
	mSelect_Step_Motor_CCR3;//配置引脚为"外围模块功能"引脚

		//CCR2//选择01 上升沿捕获+	同步捕获+CCIxA+捕获模式+捕获/比较中断
	TA1CCTL2 = CM_1 + SCS + CCIS_0 + CAP + CCIE;
		//TA0CCTL2 捕获/比较控制寄存器
		//CMx  捕获模式。//00 禁止捕获模式//01 上升沿捕获//10 下降沿捕获//11 上升沿与下降沿都捕获
		//SCS  同步捕获源。该位用来同步定时器时钟和捕获信号。//0  异步捕获 //1 同步捕获
		//CCISx 捕获/比较输入选择。这些位选择TAxCCRn 输入信号。//00 CCIxA  //01 CCIxB  //10 GND  //11 Vcc
		//CAP  捕获模式  //0  比较模式	// 1  捕获模式
		//CCIE 捕获/比较中断使能。该位使能相应的CCIFG 标志的中断请求。

////////////////////////////////////////////////////////////////////////////
//==**启动定时器开始计数(选择计数模式)"**============//
		//care--MCx>0 并且时钟源在活动状态时，定时器开始计数
	TA1CTL |= MC_2; //选择连续计数模式，并开始计数(定时器增计数到0FFFFh)

}



