/*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=
* 文件名-FileName:			 UART_RS485.c
* 附属文件-Dependencies:  	 UART.h;  msp430f6638.h;
                                                        Hardware_Profile.h; Generic.h;
* 文件描述-File Description:	 ( 源程序-Source File) 
	■ "UART_RS485  串口通信" -驱动程序(外部资源)
	01) RS-485总线,在要求通信距离为几十米到上千米时，广泛采用RS-485 
串行总线标准。RS-485采用平衡发送和差分接收，因此具有抑制共模
干扰的能力。加上总线收发器具有高灵敏度，能检测低至200mV的电压，
故传输信号能在千米以外得到恢复。
	02) RS-485采用半双工工作方式，任何时候只能有一点处于发送状态，
因此，发送电路须由使能信号加以控制。RS-485用于多点互连时非常
方便，可以省掉许多信号线。应用RS-485 可以联网构成分布式系统，
其允许最多并联32台驱动器和32台接收器。 
	03)	
	04)

	06)    	07)
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 注意事项-Attention : 	
	▲01) 当 DE为低电平的时候，接收有效，发送被禁止。A，B为高阻态。
	▲02) 当 DE为高电平的时候，发送有效。A、B的输出根据输入 D来定。 
	▲03) 当 /RE为高的时候，驱动器输出缓冲失效。R（输出）为高阻态。 
	▲04) 当/RE 为低的时候，驱动器有效。R（输出）反映差分信号的 A、B的输入情况。 
	▲05) 原理图中，DE和/RE信号接在一起，由一个 IO口控制，因此
同一时刻，接收和发送只能一个有效。要么发送，要么接收。
	▲06) 将两块开发板的 RX、TX直接相连；    
	▲07) RS485接口组成的半双工网络，一般是两线制。　
		     RS232C串口通信接线方法（三线制） 。
	▲08) RS232、RS485只能代表通讯的物理介质层和链路层，
如果要实现数据的双向访问，就必须自己编写通讯应用程序。
	▲09)使能RS485的发送状态时，要有一定的延时

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  
* 修改记录-Change History:   
	作者   时间        版本  内容描述
	Author 	 Date		   Rev      Comment
	-------------------------------------------------------------------------------
	BlueS	2012-12-12	  1.0	   
			xxxx-xx-xx	  x.x	   
			xxxx-xx-xx	  x.x				
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~	
* 公司-Company: 			CS-EMLAB  Co. , Ltd.
* 软件许可协议-Software License Agreement:
	Copyright (C) 2012-2020 	CS-EMLAB  Co. , Ltd.	All rights reserved.	

*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*/


#include "Generic.h"	//常用程序编程规范、函数集 -头文件-Generic Type Definitions

#include "Hardware_Profile.h"  //处理器"硬件配置文件" -Hardware specific definitions for Processor



#include "msp430f6638.h"   // "处理器"头文件: 内部寄存相关定义等(处理器内部资源) 

#include "UART.h"   //"UART 通用异步接收/发送装置" -驱动程序(内部资源)-头文件



////////////////////////////////////////////////////////////////////////////
//==**全局变量定义**Global variables**========================//
////////////////////////////////////////////////////////////////////////////
unsigned char G_RxData_RS485 = 0xFF;  //缓存 "RS485_UART   串口通信"接收到的数据



////////////////////////////////////////////////////////////////////////////
//==**局部变量定义**Local variables**========================//
////////////////////////////////////////////////////////////////////////////

/****************************************************************************
*函数名-Function:	void Sent_OneByte_RS485_UART(unsigned char byte) 
*描述- Description:		RS232 通过UART发送一个字节数据
*输入参数-Input:	byte:  要发送的字节数据
*输出参数-output:	None
*注意事项-Note： ▲01)	▲02) 	▲03) 	▲04)  
*****************************************************************************/
void Sent_OneByte_RS485_UART(unsigned char byte) //RS232 通过UART发送一个字节数据
{
	Initial_RS485_UART();  //初始化设置:  "RS485_UART  串口通信"
	
//	DE;  // 设置RS485芯片处于发送状态
	WaitingDelayMs(1);  //使能RS485的发送状态时，要有一定的延时

	Send_OneByte_UART_A(byte); //UART 发送一个字节数据--"UART 通用异步接收/发送装置"

	WaitingDelayMs(1);
//	RE;    // 设置RS485芯片处于接收状态
}









